cpp.tex
% Created 2016-09-22 周四 12:06
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{xuzhixin}
\date{\today}
\title{cpp}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\begin{itemize}
\item strlen(char*)就算字符串的长度，返回直到'$\backslash$0'的长度(不包括'$\backslash$0')，如果找不
到'$\backslash$0'，它会一直找下去
\item 严格的说，每个指针在初始化前都是野指针。delete ptr; ptr = NULL//删除
ptr指向的内存ptr如果不设为NULL就会成为野指针
\item 溢出问题
\item int arr[] = \{1, 2\}; int arr2[] = \{3, 4\}; arr2 = arr;//不合法
\item +优先级高于<<
\item c默认const是外部连接的，c++默认const是内部连接的
\item 静态变量存在全局数据区，sizeof只计算栈中分配的大小
\item strlen和sizeof的区别：strlen的参数必须是char*，且以'$\backslash$0'结尾。sizeof是运
算符，strlen是函数。p56，面试宝典
\item 数组传递给sizeof不会退化成指针
\item sizeof里的内容在编译时不被编译，只是被相应类型替换：a=8;siof(a=6);//a还
是等于8
\item 虚继承和虚函数都涉及一个虚函数表，就要为类生成一个指针，sizeof此类大小
会加4，p60，面试宝典
\item inline必须与函数定义放在一起才能成为内联函数，和函数声明放一起不行
\item extern C，实现C和C++的混合编程。extern表明变量声明，而非定义
\item 注意函数如果返回类型不为void，则结尾必须要返回一个值：仔细看
leetcode-211！！！！
\item string str = "xuzhixin";//以"xuzhixin"初始化str，不包括结尾的空字符
\item 类的静态成员函数才能用于sort中的比较函数：leetcode-179
\item sort(a.begin(), a.end(), compare);//compare定义了比较规则
\item malloc/free是库函数，只能分配内部数据类型；new/delete是运算符，可以自动
为类对象执行构造和析构函数
\item 深拷贝与浅拷贝
\item cin带逗号的输入，见test\_ cin.cpp： int a, b; cin >> a; cin.ignore(1,
','); cin >> b;//要包含头文件\#include<cstdlib>
\item string str; cin >> str;//遇到空格终止；getline(cin, str);//遇到空格不终
止，enter终止；cout << str; //输出整个str
\item 解引用*比加号+优先级低
\end{itemize}

\section{字符串，向量和数组}
\label{sec-1}
\subsection{vector}
\label{sec-1-1}
\begin{itemize}
\item vector 能容纳大多数类型的对象作为其元素，但是引用不是对象，故不存在包含
引用的vector
\item vector 对象的类型总是包含着元素的类型 vector<int>::size\_ type 正确
\item 两个vector对象比较时，所包含的元素必须是可比较的类生成的对象
\item 缓冲区溢出（buffer overflow）：通过下标访问不存在的元素（数组，string，vector 等）
\item vector限制：1. 不能再范围for循环中向vector对象添加元素；2. 任何一种改变
vector对象容量的操作，如push\_ back都会使该vector对象的迭代器失效
\end{itemize}

\subsection{迭代器}
\label{sec-1-2}
\begin{itemize}
\item string对象不属于容器，但支持很多与容器类型相似的操作
\item 如果容器为空，则成员begin和end返回同一个迭代器，都是尾后迭代器
\item begin 和end返回的类型有对象是否是常量决定，如果是，返回const\_ iterator
否则返回iterator
\item 无论容器（string）对象本身是否是常量，返回值都是const\_ iterator
\item 但凡使用了迭代器的循环体，都不要向迭代器所属的容器中添加元素
\item 所有标准库容器的迭代器都只吃递增运算和比较运算符！= 和 ==
\end{itemize}

\subsection{数组}
\label{sec-1-3}
\begin{itemize}
\item 声明时的维度必须是 \textbf{常量表达式}
\item 数组的元素应为对象，故不存在引用的数组
\item 初始值可少不可以多
\item 字符数组的特殊性：char a[] = "C++"，a的维数为4
\item 不能将数组的内容拷贝给其它数组作为初始值，也不能用数组为其他数组赋值
\item int *ptr\footnote{DEFINITION NOT FOUND.} 是含有十个整型指针的数组
\item int \&refs\footnotemark[1]{} 错误，不存在引用的数组
\item int (*Parray)\footnotemark[1]{} = \&arr ，指向一个含有十个整数的数组
\item int (\&arrRef)\footnotemark[1]{} = arr，引用一个含有十个整数的数组
\item int a[] = \{0,1\};auto a2(a); //a2是一个整型指针，指向a的第一个元素
\item decltype(a) a3 = \{0,1\}; //a3是一个两个整型（和a维数相同）数组
\item 容器的迭代器支持的运算，数组的指针全部支持
\item 尾后指针不能执行解引用和递增操作
\item p107，c++primer
\item 不允许数组和vector对象为内置类型的数组初始化，但是可以使用数组来初始化
vector对象
\item c++中没有多维数组，多维数组其实就是数组的数组，第一维行，第二维列
\item 为了防止数组被自动转成指针，使用范围for语句处理多维数组时，除了最内层的
循环外，其它所有循环的控制变量都应该是引用类型 p114，c++primer
\item 当程序使用多维数组的名字时，也会自动将其转换成指向数组首地址的指针
\item 别名：using intArray = int\footnote{DEFINITION NOT FOUND.} ; typedef int intArray\footnotemark[2]{};等价
\end{itemize}

\section{表达式}
\label{sec-2}
\subsection{基础}
\label{sec-2-1}
\begin{itemize}
\item C++定义了一元二元三元运算符，函数调用也是一种特殊的运算符，他对运算对象
的数量没有限制
\item 右值使用表达式的值，左值使用表达式的身份
\item 使用重载运算符时，包括运算对象的类型和返回值的类型，都是由该运算符定义
的；但是运算对象的个数、运算符的优先级和结合律都是无法改变的
\item 复合表达式是指含有两个或多个运算符的表达式
\item 对于没有指定执行顺序的运算符，如果表达式指向并修改了同一个对象，将会引
发错误并产生未定义的行为：cout<<i<<" "<<++i<<endl;//未定义的
\item 两条准则：1. 使用括号；2. 如果改变了某个运算对象的值，在表达式的其它地
方不要再使用这个运算对象（当改变运算对象的子表达式本省就是另外一个子表
达式的运算对象时，该规则无效，如*++iter）
\item 算术运算符的运算对象和求值结果都是右值，在表达式求值之前，小整数类型的
运算对象被提升成较大的整数类型，所有运算对象最终会转换成同一类型
\item 对大多数运算符来说，布尔类型的运算对象被提升成int类型
\item 整数相除（/）结果还是整数，参与取余运算的运算对象必须是整数类型
\item 两个运算对象的符号相同则为正（如果不为0的话），否则为负；C++11新标准规
定商一律向零取整（即直接切除小数部分）
\item m，n为整数，则(m/n)*n+m\%n==m；(-m)/n,m/(-n)都等于-(m/n)，
m\%(-n)==m\%n,(-m)\%n==-(m\%n)
\item 关系运算符作用于算术或指针类型，逻辑运算符作用于任意能转换成布尔值得类
型，返回值都是布尔类型，运算对象和求值结果都是右值；值为0的运算对象（算
术或指针类型）表示假，否则为真
\item i<j<k 应该写成(i<j\&\&j<k)
\item 对于赋值运算符，如果左侧对象是内置类型，那么初始值列表最多只能包含一个
值，而且该值类型所占空间不应该大于目标类型的空间：int k；k=\{3.14\}//错误；
初始值列表总是可以为空
\item 对于多重赋值语句的每一个对象，它的类型或者与右边对象的的类型相同，或者
可有右边对象的类型转换得到:int ival, *pval;ival=pval=0//错误！！！！
\item 尽量使用前置版本的递增递减运算符（--i，++i），后置版本会增加开销
\item 后置递增运算符优先级高于解引用运算符（*iter++）
\item 箭头运算符作用于一个指针类型的运算对象，结果是一个左值。点运算符，如果
成员所属的对象是个左值，那么结果是左值，否则结果是右值
\item 对于条件运算符，当两个表达式都是左值或者能转换成同一种左值类型时，运算
结果是左值，否则是右值
\item 条件运算符优先级非常低
\item 位运算符作用于整数类型的运算对象，强烈建议只将位运算符用于处理无符号类
型；char类型的运算对象首先被提升成int类型
\item 1UL<<27，将无符号的1左移27位，结果只有其第27位上是1，其余为0
\end{itemize}
\subsection{sizeof运算符}
\label{sec-2-2}
\begin{itemize}
\item 返回一个表达式或一个类型名字所占的字节数，满足右结合律，值为size\_ t类型
的常量表达式，形式：sizeof (type);sizeof expr//返回表达式结果类型的大小。
\item sizeof并不实际计算其运算对象的值
\item Sales\_ data data, *p;sizeof(Sales\_ data)==sizeof(data)==sizeof(*p)//返
回Sales\_ data类型对象所占空间的大小；sizeof(p);//指针所占空间的大小，
32位系统为4，4位系统为8；sizeof data.revenue==sizeof Sales\_
data::revenue//revenue成员对应类型的大小
\item 因为sizeof不会实际求运算对象的值，故可以作用于无效指针（未初始化）；在
sizeof的运算对象中解引用一个无效指针也是安全行为，因为指针实际上未被真
正使用，sizeof不需要真正解引用指针也能知道他所指对象的类型
\item sizeof:char-1,int-4,float-4,double-8,long-4,long long-8
\item 对引用类型执行sizeof得到所指向对象所占空间的大小
\item 数组：等价于对数组中所有元素各执行一次sizeof并求和，sizeof运算不会把数
组转化成指针来处理
\item 对string或vector对象求执行sizeof，只返回该类型固定部分的大小，不会计算
对象中的元素占用了多少空间；string-4,vector<int>-12,vector<char>-12
\end{itemize}
\subsection{类型转换（在仔细看）}
\label{sec-2-3}
\begin{itemize}
\item 表达式中既有整型又有浮点型运算对象，整型会转换成浮点型
\item 强制类型转换：cast-name<type>(expr)。cast-name：static\_ cast，dynamic\_
cast，const\_ cast，reinterpret\_ cast。
\item static\_ cast：只要不包含底层const都可以使用，当把较大的算术类型赋给较小
的时比较有用，以及编译器无法自动执行的类型转换。void * p=\&d;double
dp=static\_ cast<double*>(p);//将void*转换回初始的指针类型，任何非常量对
象的地址都能存入void*
\item const\_ cast：只能改变运算对象的底层const（且只有它能改变），常用于函数
重载的上下文中，必须运算对象本身不是常量，否则产生未定义的后果
\end{itemize}

\section{语句}
\label{sec-3}
\begin{itemize}
\item 空语句：;//空语句：while (cin>>s\&\&s!=sought) ; //空语句和while循环一体
\item 符合语句也称为快，一个快就是一个作用域，快不以分号作为结束
\item switch语句首先对括号里的表达式求值，如果表达式和某个case标签的值匹配成
功，程序从该标签后的第一条语句开始执行， \textbf{直到到达了switch的结尾} 或者是遇
到了一条break语句为止
\item case标签必须是整型常量表达式，任意两个case标签的值不能相同
\item p163，c++primer ！！！！！！！！！！！！！！！！！！！
\item 定义在while条件部分或者while循环体内的变量每次迭代都经历从创建到销毁的
过程
\item for(init-statement;condition;expression) statement //和其他声明一样，
init-statement也可以定义多个对象，但是init-statement只能有一条声明语句，
故所有变量的基础类型必须相同
\item 范围for语句中，预存了end()的值，一旦在序列中增加（删除）元素，end函数的
值就可能变得无效了
\item do statement while(condition)//condition不能为空，condition使用的变量必
须定义在循环体之外
\item 只有当switch语句嵌套在迭代语句内部时，才能在switch里使用continue
\item goto label;label:\ldots{}//不要在程序中使用goto
\item 看异常处理
\end{itemize}

\section{函数}
\label{sec-4}
\begin{itemize}
\item 函数是一个命了名的代码块，通过调用函数执行相应的代码。可以重载函数，即
同一个名字可以对应几个不同的函数
\item 函数：1. 返回类型；2. 函数名字；3. 0个或多个参数组成的列表；4. 函数体
\item 编译器能以任意可行的顺序对实参求值
\item 实参和形参类型相同，或实参类型能转换成形参类型
\item 使用void显示定义空形参列表：void f(void)\{\}
\item 形参列表中的形参通常用逗号隔开，其中每个形参都是含有一个声明符的声明：
int f(int v1, v2)//错误
\item 任意两个形参不能同名，函数最外层的局部变量也不能使用与函数形参一样的名
字
\item 返回类型可以是void，表示不返回任何值。函数的返回值不能是数组类型或函数
类型，但可以是指向数组或函数的指针（数组的引用）
\item 名字有作用域，对象有生命周期。作用域：程序文本的一部分，名字在其中可见；
生命周期：是程序执行过程中该对象存在的一段时间
\item 我们把只存在于快执行期间的对象称为自动对象，形参是一种自动对象
\item 局部静态变量static，在程序执行路径第一次经过对象定义语句时初始化，并且
直到程序终止才被销毁（之后经过对象定义语句时忽略？）
\item 形参和函数体内部定义的变量统称为局部变量
\item 函数只能定义一次，但可以声明多次，函数声明无需函数体，只需;代替
\item 函数三要素：1. 返回类型，2. 函数名，3. 形参类型。描述了函数的接口，函数
声明也称函数原型
\item \textbf{分离式编译} p186，C++primer
\end{itemize}
