cpp.tex

\subsection{参数传递}
\label{sec-4-1}
\begin{itemize}
\item 形参初始化的机理与变量初始化一样
\item 参数传递分：1. 传值参数（包括指针形参）， 2. 传引用参数
\item C++中，建议使用引用类型的形参替代指针
\item 使用引用避免拷贝，如果函数无需改变引用形参的值，最好将其声明为常量引用
\item 使用引用形参返回额外信息
\item 当形参有顶层const时，传给他常量对象和非常量对象都是可以的（即忽略掉顶层
const）
\item 可以定义具有相同名字的函数，但是不同函数的形参列表必须有明显的区别：
void fcn(const int i)\{\} void fcn(int i)\{\}//错误，重复定义了fcn(int)
\item int \& r = 42;//错误，不能用自面值初始化一个常量引用
\item C++允许我们用自面值初始化常量引用
\item 把函数不会改变的形参尽量定义成常量引用。非常量引用限制了函数所能接受的
实参类型。我们不能把const对象，字面值或者 \textbf{需要类型转换的对象} 传递给普
通的引用形参
\item 数组不允许拷贝和赋值；使用数组时（通常）会将其转换成指针
\item 数组：int j\footnote{DEFINITION NOT FOUND.} = \{0, 1\}; fcn(begin(j), end(j));//针对数组的begin和end函
数
\item 如果我们传给fcn函数的是一个数组，则实参自动的转换成指向数组首元素的指针，
数组的大小对函数的调用没有影响：void print(const int*);void
print(const int[]);void print(const int\footnotemark[1]{});三者等价。
\item 以数组作为形参的函数在使用数组时确保不要越界
\item 因为数组以指针的方式传给函数，所以一开始并不知道数组的尺寸，调用者应该
为此提供一些额外的信息：1. 使用标记指定数组的长度（'$\backslash$0'）；2. 使用标准
库规范（begin()，end()）；3. 显示传递一个表示数组大小的形参
\item 把数组引用作为形参：void print(int (\&arr)\footnotemark[1]{})\{for (auto elem:arr)
cout<<elem<<endl;\}//\&arr两端的括号必不可少；需要指明数组的大小
\item main：命令行处理选项 p196，C++primer
\item 含有可变形参的函数：1. initializer\_ list形参；2. 省略符形参：仅仅用于C
和C++通用的类型
\item return语句的两种形式：1. return; 2. return expr; \textbf{注意} 不存在 return
void 形式
\item 无返回值函数：返回类型是void的函数，返回void的函数不要求非得要return语
句，这类函数的最后一句后面会隐式的执行return
\item 返回类型时void的函数使用return语句的第二种形式：expr必须是另一个返回
void的函数。强行令void函数返回其它类型的表达式会产生错误
\item 如果函数的返回类型不是void，则该函数内的每条return语句必须返回一个值
（编译器会检查）。return语句的返回类型与函数的返回类型相同，或者能隐式
的转换成函数的返回类型
\item 返回一个值的方式与初始化一个变量或形参的方式完全一样
\item 不要返回局部对象的引用或指针
\end{itemize}

\subsection{函数重载}
\label{sec-4-2}
\begin{itemize}
\item 同一作用域内几个函数名字相同但形参列表不同，我们称之为重载函数，main函
数不能重载
\item 对于重载函数，他们应该在形参数量或形参类型上有所不同， \textbf{不允许两个函数
除了返回类型外其它所有的要素都相同} （第二个函数声明时错误的）
\item 顶层const不影响传入函数的对象。一个拥有顶层const的形参无法与一个没有顶
层const的形参区分开来：Record lookup(Phone);Record lookup(const
Phone);重复声明了；Record lookup(Phone *);Record lookup(Phone
*const);//重复声明
\item 如果形参是某种类型的指针或引用，则通过区分其指向的是常量对象还是非常量
对象可以实现函数重载，此时的const是底层的
\item 是否重载函数要看是否更容易理解
\item const\_ cast在重载函数的场景中最有用const\_ cast<const
string\&>(s);const\_ cast<string\&>(s);
\item 调用重载函数时有三种结果：1. 编译器找到一个与实参 \textbf{最佳匹配} 的函数，并
生成调用该函数的代码；2. 找不到，此时编译器发出 \textbf{无匹配} 的错误信息；
\begin{enumerate}
\item 找到多余一个的函数可以匹配，但是每个都不是最佳选择， \textbf{二义性调用}
\end{enumerate}
\item 对于新作用域中的函数，隐藏外层定义域中的函数（或变量）
\item 在C++中，名字查找发生在类型检查之前
\item p211，C++primer
\end{itemize}
\subsection{特殊用途语言特性}
\label{sec-4-3}
\begin{itemize}
\item 可以为一个或多个形参定义默认值，一旦某个形参被赋予了默认值，其后的形参
必须都有默认值（否则编译错误）
\item 函数调用时只能省略尾部的实参:window = screen(,,'?')//错误；window =
screen('?');//调用screen('?',80,' ')
\item 在给定的作用域中，一个形参只能被赋予一次默认实参。函数的后续声明只能为
那些之前没有默认值的形参添加默认实参，而且该形参右侧的所有形参必须都有
默认实参
\item p213C++primer
\item 内联函数(inline)可以避免函数调用的开销，通常就是在每个调用点上内联的展
开；在返回类型前加上inline可将函数声明成内联函数
\item constexpr函数是指能用于常量表达式的函数，其定义需满足：1. 函数的返回类
型和所有形参类型都得是字面值类型；2. 函数体中必须有且只有一条return语句
（可以包含其他语句，但这些语句不能执行任何操作：空语句，类型别名，
using声明等）
\item constexpr函数被隐式的指定为内联函数，constexpr函数不一定返回常量表达式
\item 最好把inline函数和constexpr函数放在头文件中
\item c中的name.h文件在c++中为cname文件
\end{itemize}
\subsection{调试帮助}
\label{sec-4-4}
\begin{itemize}
\item 预处理宏实际上是一个预处理变量
\item assert是一种预处理宏：assert(expr)，首先对expr求值，如果表达式为假（即
0），assert输出信息并终止程序的执行，否则什么也不做
\item assert宏定义在cassert中，预处理名字由预处理器而非编译器管理。因此我们可
以直接使用预处理名字而无需using声明
\item 和预处理变量一样，宏名字在程序中必须唯一
\item assert的行为依赖一个名为NDEBUG的预处理变量的状态，如果定义了NDEBUG，则
assert什么也不做。默认状态下没有定义NDEBUG
\item \uline{\_ func \_} 输出当前调试的函数的名字，由编译器定义
\item 预处理器定义的名字：\_\_ FILE \uline{\_ , \_} LINE \uline{\_ , \_} TIME \uline{\_ , \_} DATE \_\_
\end{itemize}
\subsection{函数匹配}
\label{sec-4-5}
\begin{itemize}
\item 函数匹配三步：1. 确定候选函数；2. 确定可行函数；3. 寻找最佳匹配
\item 候选函数：1. 与被调用的函数同名；2. 其声明在调用点可见
\item 可行函数：1. 其形参数量与本次调用所提供的实参数量相同；2. 每个实参类型
与对应的形参类型相同，或者能转换成形参的类型
\item 寻找最佳匹配，有且只有一个函数满足下列条件：1. 该函数对每个实参的匹配都
不劣于其它可行函数需要的匹配；2. 至少有一个实参的匹配由于其它可行函数提
供的匹配。如果无这样的函数，则该调用是错误的
\item 调用重载函数时，尽量避免强制类型转换
\item 小整型一般会提升成int类型或更大的整数类型
\item 所有算术类型转换的级别都一样
\item 编译器可以通过实参是否是常量来决定选择哪个函数（针对引用和指针）
\end{itemize}
\subsection{函数指针}
\label{sec-4-6}
\begin{itemize}
\item 函数指针指向的是函数而非对象。和其他指针一样，函数指针指向某种特定（函
数）类型。函数类型由他的返回类型和形参类型决定， \textbf{与函数名无关}
\item 声明一个指向函数的指针，只需用指针替换函数名即可：bool (*pf)(const
string \&);//未初始化的指针pf，*pf两端的括号必不可少（否则成了声明一个名
为pf的函数，该函数返回bool *）
\item 当我们把函数名作为一个值使用时，该函数自动转换成指针：pf =
lengthCompare; pf = \&lengthCompare;//等价；取地址符是可选的
\item 我们能直接使用指向函数的指针调用该函数，无需提前解引用指针：bool b1 =
pf("fuck"); bool b2 = (*pf)("fuck"); bool b3 =
lengthCompare("fuck");//三者等价
\item 指向不同函数类型的指针之间不存在转换规则。可以为函数指针赋一个nullptr或
者值为0的整型常量表达式
\item 重载函数的指针
\item 和数组类似，形参可以是指向函数的指针，此时，形参看起来是函数类型，实际
上是当作指针用（自动转换成指针）
\item decltype返回函数类型，不会将函数类型自动转成指针类型
\item 和数组类似，不能返回一个函数，但是可以返回一个指向函数类型的指针
\item 返回执行函数的指针：和函数类型的实参不同，返回类型不会自动的转换成指针，
我们必须显示的将返回类型指定为指针
\item 定义：int a = b =1;//不合法，此时b未定义；int b, a = b = 1;//可以
\end{itemize}

\section{类}
\label{sec-5}
\subsection{定义抽象数据类型}
\label{sec-5-1}
\begin{itemize}
\item 类的基本思想是数据抽象和封装。数据抽象是一种依赖于接口和实现分离的编程
技术；封装则实现了类的接口和实现的分离
\item 类设计者必须充分关注使用该类的程序员需要的功能
\item 类的成员函数的声明必须在类的内部，定义则既可以在类的内部也可以在类的外
部。定义在类内部的函数是隐式的inline函数
\item 任何对类成员的直接访问都被看作this的隐式引用。任何自定义名为this的参数
或变量（不在类中也不行）的行为都是非法的。我们可以在成员函数体内部使用
this
\item this 是一个常量指针，我们不允许改变this中保存的地址。当一个类对象使用成
员函数时，编译器把该对象的地址传给this
\item 默认情况下，this的类型是指向类类型非常量版本的常量指针
\item const成员函数：string isbn() const\{return bookNo;\}const的作用是修改隐式
this指针的类型，表示this是一个指向常量的指针，p231C++primer
\item 尽管this是隐式的，但是他仍然要遵循初始化规则，意味着（默认情况下）我们
不能把this对象绑定到一个常量对象上，这使得我们不能在一个常量对象上调用
普通的成员函数(因为一旦调用，则一般情况下需要访问类的数据成员，此时需要
利用this指针，而this指针需要初始化，但他是指向非常量的常量指针)
\item 常量对象，以及常量对象的引用或指针只能调用常量成员函数
\item 编译器处理类：1. 首先编译成员的声明； 2. 然后才轮到成员函数体。因此，成
员函数可以随意使用类中的其它成员而无需在意这些成员出现的次序
\item IO类属于不能被拷贝的类型，因此我们只能通过引用来传递他们
\item 默认情况下，拷贝类的对象其实拷贝的是对象的数据成员
\item 类通过一个或几个构造函数来控制其对象的初始化过程。无论何时只要类的对象
被创建，就会执行构造函数
\item 构造函数的名字和类名相同， \textbf{构造函数没有返回类型} 。构造函数可以重载
\item 构造函数不能被声明成const的，当我们创建一个类的const对象时，知道构造函
数完成初始化过程，对象才能真正获得其“常量”属性
\item 编译器创建的构造函数叫 \textbf{合成的默认构造函数} ，对大多数类来说，合成的默
认构造函数按照如下规则初始化类的数据成员：1. 如果存在类内的初始值，用它
来初始化成员；2. 否则，默认初始化该成员
\item 编译器只有在发现类中没有声明任何构造函数时，才会自动生成默认构造函数
\item 如果已经定义了其它构造函数，那么亦必须定义一个默认构造函数：
SalesData() = default;//这个函数的作用完全等同于之前使用的合成默认构造
函数
\end{itemize}

\subsection{访问控制与封装}
\label{sec-5-2}
\begin{itemize}
\item 使用class和struct定义类唯一的区别是默认的访问权限：class默认private；
struct默认public
\item 类允许其它类或者函数访问它的非公有成员，使用friend（友元）进行函数声明：
友元声明只能在类定义的内部，但是在类内出现的具体位置不限（不是类的成员，
不受访问控制的约束）
\item 封装的好处：1. 确保用户代码不会无意间破坏封装对象的状态；2. 类的具体实
现可以随时修改，而无需调整用户级别的代码（类的定义发生变化时，使用该类
的源文件需要重新编译）
\item 友元声明仅仅指定了访问的权限，而非通常意义上的函数声明
\item 定义一个类型成员：类可以定义某种类型在类中的别名，类型名字也存在访问权
限。用来定义类型的成员必须先定义后使用，这和普通成员不同！！！！！！
\item 使用mutable关键字声明可变数据成员，使其永远不是const，即使对象是const，
const函数也可以改变其值
\item 类内初始值必须使用=得初始化形式或者花括号括起来的直接初始化形式
\item 返回引用的函数是左值的
\item 一个const成员函数如果以引用的形式返回*this，则它的返回类型将是常量引用
（即使对象本身是非常量的）
\item 对于两个类来说，即使成员完全一样，只要类名不同就是不同的类
\item 我们可以只声明类但是暂时不定义它（前向声明），在其声明之后定义之前他是
一个不完全类型。只能在两种情况下使用：1. 可以定义指向这种类型的指针或引
用；2.亦可以声明（但是不能定义）以不完全类型作为参数或返回类型的函数
\item \textbf{类的成员类型不能是该类自己，但是类中可以包含指向他自身的引用或者指针}
\item 类还可以把其它类定义成友元，或者把已经定义过的类的成员函数定义成友元。
友元函数能定义在类的内部，这样的函数是隐式内联的
\item 友元关系不存在传递性
\item p252C++primer
\end{itemize}
\subsection{类的作用域}
\label{sec-5-3}
\begin{itemize}
\item 在类的作用域之外，普通的数据和函数成员只能由对象，引用或者指针使用成员
访问运算符来访问
\item 函数的返回类型通常出现在函数名之前，若函数定义在类的外部，则类中定义的
类型成员是函数的返回类型的话，必须要指定其所在的类 p253C++primer
\item 编译器处理完类中的全部声明后才回处理成员函数的定义
\item 不能在类中定义已经使用过（定义过）的类型别名
\item 使用::height在类中指明一个全局height，而非类中的height
\item 构造函数初始化类的数据成员和为数据成员赋值的区别p258C++primer
\item 如果成员是const或者是引用，或者当成员属于某种类类型且该类没有定义默认构
造函数时，必须将成员初始化
\item 成员的初始化顺序与他们在类中的定义顺序一致，构造函数初始值列表中的初始
值的位置关系不会影响实际的初始化顺序
\item \textbf{如果一个构造函数为所有参数都提供了默认实参，则他实际上也定义了默认构造
函数}
\item C++11中可以使用委托构造函数p261C++primer
\item 如果定义了其它构造函数，最好也提供一个默认构造函数
\item SalesData obj();//定义了一个函数而非对象
\item 如果构造函数直接受一个实参，则它实际定义了转换为此类类型的隐式转换机制，
称之为转换构造函数：可以从构造函数的参数类型向类类型隐式转换
\item \textbf{只允许一步类类型转换}
\item 构造函数前加上explicit可以阻止 \textbf{隐式} 的向类类型的转换：只对一个实参的构造
函数有效。只能在类内声明构造函数时使用explicit关键字， \textbf{在类外部定义时
不能重复}
\item explicit构造函数只能用于直接初始化，不能用于拷贝初始化（=形式）
\item 编译器不会将explicit构造函数用于隐式转换过程，但是我们可以使用这样的构
造函数显示的强制进行转换
\item 当在类的外部定义静态成员时，不能重复static关键字
\item 从类名开始，一条定义语句的剩余部分就都在类的作用域之内了
\item 类的静态成员和普通成员的区别：静态成员可以是不完全类型（在一个类内定义
此类类型的static对象成员；可以使用静态成员作为默认实参
\end{itemize}
