cpp.org
* 顺序容器
+ string和vector将元素保存在连续的内存空间
+ list，forward_ list 在容器中的任何位置添加和删除元素都很快，代价是，不
  支持随机访问；额外内存开销很大
+ 通常，使用vector时最好的选择
+ 容器：顺序容器，关联容器，无序容器。容器皆定义为模板类
+ a.swap(b) == swap(a, b)//交换a，b的元素
+ forward_ list迭代器不支持递减运算符（--）
+ 严格来说，string对象不属于容器类型，但是string支持很多与容器类型类似的
  操作
+ 所有标准库容器都支持下标操作，但是其中只有少数几种才同时支持下标运算符
+ 迭代器范围是左闭合区间(begin, end)
+ 迭代器begin和end必须指向相同的容器，end可以与begin指向相同的容器，但是
  end不能指向begin之前的位置
+ 对一个反向迭代器使用++操作会得到上一个元素
+ 当将一个容器初始化为另一个容器的拷贝时，两个容器的容器类型和元素类型必
  须都相同；当传递迭代器参数来拷贝一个范围时，容器类型可以不同，容器中的
  元素类型也可以不同，只要能转换成目标容器中的元素类型就行
+ 只有顺序容器（除了array）的构造函数才接受大小参数，关联容器并不支持
  （string不支持 string str(n)的形式）
+ 与内置数组一样，标准库array的大小也是类型的一部分：array<int, 42> arr;
+ 数组不支持拷贝和赋值，但是array支持（类型和大小都相同）
+ array类型不支持assign，不允许用花括号包围的值列表进行赋值（可以用之来初
  始化）
+ swap只是交换了两个容器的内部数据结构，不对任何元素进行拷贝，删除或插入
  操作，可在常数时间内完成；对string调用swap会导致迭代器，引用和指针失效
  （对其余容器不会）；swap两个数组会真正交换他们的内容，时间O(n)
+ 关系运算符：除了无序关联容器外的所有容器都支持关系运算符(>, >=, < ,
  <=)，两个运算对象必须具有相同的类型，和相同的元素类型
+ 顺序容器和关联容器的不同之处在于两者组织元素的方式，这些不同直接关系到
  了元素如何存储，访问，添加和删除
+ forward_ list不支持push_ back和emplace_ back；vector和string不支持
  push_ front和emplace_ front
+ *容器元素是拷贝，当我们将一个对象插入到容器中时，实际上放入容器中的是对
  象值的一个拷贝，而不是对象本身*
+ emplace操作：直接构造而不是拷贝元素，传递给emplace函数的参数必须与元素
  类型的构造函数相匹配
+ 访问容器元素：包括array在内的每个顺序容器都有一个front函数，而除
  forward_ list之外的所有顺序容器都有一个back成员函数，这两个操作分别返回
  首元素和尾元素的引用；若容器为空，函数行为未定义
+ 不能递减forward_ list迭代器
+ 访问成员函数返回的是引用：front，back，下标和at函数。使用下标不负责检查
  是否越界，at函数检查
+ pop_ back和pop_ front函数返回void
+ 如果容器是vector或string，且存储空间被重新分配，则指向容器的迭代器，引
  用和指针都会失效
+ 当我们添加或删除vector或string的元素后，或在deque的首元素之外的任何位置
  添加删除元素后，原来end返回的迭代器都会失效：添加或删除元素的循环程序必
  须反复调用end，而不能在循环之前保存end返回的迭代器，一直当迭代器末尾使
  用
+ 三个顺序容器的适配器：stack，queue，priority_ queue
+ 适配器是标准库的一个通用概念，容器，迭代器和函数都有适配器。一个适配器
  是一种机制，能使某种事物的行为看起来像另外一种事物一样。一个容器适配器
  接受一种已有的容器类型，使其行为看起来像一种不同的类型
+ 每个适配器有两个构造函数：1. 默认构造函数默认构造函数创建一个空对象；
  1. 接受一个容器的构造函数拷贝该容器来初始化适配器
+ 默认情况下，stack和queue基于deque实现，priority_ queue基于vector实现
* 泛型算法
+ 实现了一些经典算法的接口，泛型指的是他们可以用于不同类型的元素和多种容
  器类型
+ 一般情况下，这些算法不直接操作容器，而是遍历由两个迭代器指定的一个元素
  范围
+ *迭代器令算法不依赖于容器* ，但算法依赖于元素类型的操作：泛型算法本身不
  会执行容器的操作，他们只会运行与迭代器之上，执行迭代器的操作。必要的编
  程假定：算法永远不会改变底层容器的大小
+ 标准库在iterator中还定义了额外几种迭代器：插入迭代器，流迭代器，反向迭
  代器，移动迭代器
+ 迭代器类别：输入迭代器，输出迭代器，前向迭代器，双向迭代器，随机访问迭
  代器
* 关联容器
+ 关联容器和顺序容器的区别：关联容器中的元素是按关键字来保存和访问的；顺
  序容器中的元素是按他们在容器中的位置来顺序保存和访问的
+ map是关键字-值对的集合，通常被称为关联数组，存储的元素为pair类型的对象，
  用.first和.second获取键和值
+ 关联容器支持普通的容器操作但是不支持顺序容器的位置相关的操作；关联容器
  的迭代器都是双向的
+ map和set的关键字唯一，multiset和multimap可重复
+ 关联容器额外的类型别名：key_ type，mapped_ type，value_ type
+ 关键字部分是const的
+ *一个map的value_ type是一个pair，我么可以改变pair的值，但是不能改变关键
  字成员的值
+ set的迭代器是const的
+ 插入元素insert()， 接受一对迭代器或一个初始化列表，返回一个pair（第一个
  成员是一个迭代器，指向具有给定关键字的元素，second元素是一个bool值，指
  出元素插入成功还是已经在容器中）
+ 向multiset和multimap添加元素，使用insert返回一个指向新元素的迭代器（无
  需返回bool值）
+ map和unordered_ map可以使用下标运算符和at函数，set类型不支持下标，
  multi不支持下标。使用下标运算符，如果关键字不再map中，会为他创建一个元
  素并插入到map中（at函数不会，只会返回异常），关联值将进行值初始化（int
  为0），只能为非const的map使用下标操作
+ 当对一个map进行下标操作时，会得到一个mapped_ type对象，但是当解引用一个
  map迭代器时，会得到一个value_ type。map的下标运算符返回一个左值
+ 如果multiset和multimap具有多个元素具有给定关键字，则这些元素在 *容器*
  中会相邻存储
+ 无序关联容器：这些容器不是使用比较运算符来组织元素，而是使用一个哈希函
  数和关键字类型的==运算符
+ 无序容器存储上组织为一组桶，无序容器使用一个哈希函数把元素映射到一个桶。
  无序容器的性能依赖于哈希函数的质量和桶的数量和大小
+ 无序容器对关键字类型的要求：内置类型（指针类型），string和只能指针，可
  以直接定义
+ 我们不能 *直接* 定义关键字类型为自定义类类型的无序容器，需要重载==运算
  符

* 动态内存
+ 动态分配的：在自由空间中分配的对象（new），知道被显示释放（delete）或程
  序结束才回销毁
+ 看默认初始化和值初始化：对于内置类型，值初始化有着良好定义的值，而默认
  初始化的值则是未定义的
+ new：从自由空间中分配内存，new T分配并构造类型为T的对象，返回指向该对象
  的指针。如果T是数组类型，new返回指向数组首元素的指针。new [n] T分配n个
  类型为T的对象，并返回指向数组首元素的指针。默认情况下，分配的对象进行默
  认初始化
+ delete：释放new分配的内存。delete p释放对象，delete []p释放p指向的数组。
  p可以为空，或者指向new分配的内存
+ 自由空间：程序可用的内存池，保持动态分配的对象
+ p40，p88 C++primer
+ 程序中使用的内存：1. 静态内存：用来保存局部static对象，类static数据成员
  以及定义在任何函数之外的变量；2. 栈内存：用来保存定义在函数内的非
  static对象；3. 堆内存（自由空间）：用来存储程序员动态分配的对象
